{
    "name": "Geetesh Laddha",
    "intro": "I specialize in crafting high-quality web applications using modern technologies. I am passionate about building scalable and maintainable software solutions that deliver exceptional user experiences.",
    "description": [
        "I'm a full-stack JavaScript developer with over 5 years of experience building cool and reliable web solutions. I love diving into tech, solving tricky problems, and creating products that really deliver."
    ],
    "socialLinks": {
        "github": "https://github.com/geetesh911",
        "linkedin": "https://www.linkedin.com/in/geetesh-laddha/",
        "twitter": "https://x.com/geetesh_911"
    },
    "hardware": [
        {
            "name": "13 inch M3 MacBook Air",
            "description": "My main machine for development that I've been using for over 6 months now. Such a beast of a machine. I love it."
        },
        {
            "name": "OnePlus 9R",
            "description": "My main phone for development. I love the performance."
        },
        {
            "name": "Keychron K4 Pro",
            "description": "My main keyboard for development. I love the clicky keys and the compact size. "
        },
        {
            "name": "Samsung 27 inch 2k Monitor",
            "description": "My main monitor for development. I love the color accuracy and the size."
        }
    ],
    "workExperience": [
        {
            "name": "Nabis",
            "logo": "/images/logos/nabis.png",
            "period": "Nov 2024 - Present",
            "location": "United States (Remote)",
            "role": "Senior Software Engineer",
            "achievements": [
                "Architected 'Compliance Service' (NestJS/Kafka) tracking Farm-to-Consumer lifecycles, automating government reporting and reducing manual operations by 90%",
                "Engineered real-time integrations with state providers ensuring 100% regulatory adherence",
                "Orchestrated financial migration (Legacy to V2) with zero downtime",
                "Developed 'Payment Dashboard' using Elasticsearch for real-time financial insights"
            ]
        },
        {
            "name": "Sorice Solutions (4Medica)",
            "logo": "/images/logos/4medica.png",
            "period": "Jan 2023 - Oct 2024",
            "location": "Remote",
            "role": "Senior Software Engineer",
            "achievements": [
                "Architected FHIR-compliant Order Editing Module reducing turnaround by 70% (10 minutes to 3 minutes)",
                "Led FHIR store migration from Google Healthcare API to Aidbox, reducing costs by 30%",
                "Designed high-throughput catalog service using Elasticsearch for thousands of lab tests",
                "Engineered multi-tenant user management for complex organizational hierarchies"
            ]
        },
        {
            "name": "PillarPlus",
            "logo": "/images/logos/pillarplus.png",
            "period": "July 2020 - Dec 2022",
            "location": "Jaipur, India",
            "role": "Full Stack JavaScript Developer",
            "achievements": [
                "Developed 'External Drainage Module', compressing design lifecycle from 2 weeks to 3 hours",
                "Engineered real-time visualization modules reducing design time by 98% (3 days to 1.5 hours)",
                "Built calculation engine automating 6-hour manual process to <10 minutes",
                "Led development of dynamic Form Builder and analytics engine, and integrated complex workflows at Towercop"
            ]
        },
        {
            "name": "Freelance",
            "logo": "/images/logos/freelance.png",
            "period": "Nov 2019 - July 2020",
            "location": "Remote",
            "role": "Full Stack Engineer",
            "achievements": [
                "Architected multi-tenant AI Sales SaaS with real-time AI Voice Assistant (NestJS/PostgreSQL)",
                "Developed HIPAA-compliant telemedicine platform with automated diagnostics and e-prescriptions"
            ]
        }
    ]
}