[
    {
        "title": "NABIS - Cannabis Wholesale Platform",
        "description": "Led engineering for mission-critical Compliance and Financial verticals at Nabis, the leading cannabis wholesale platform. Architected the automated 'Compliance Service' tracking complete product lifecycle (Farm-to-Consumer), reducing manual compliance operations by 90%. Engineered real-time integrations with state-mandated compliance providers ensuring 100% regulatory adherence. Orchestrated P0 critical migration of financial service modules from Legacy to Modern architecture with zero downtime. Developed consolidated 'Payment Dashboard' aggregating complex order and payment data for real-time financial insights.",
        "link": "",
        "img": "/projects/nabis.webp",
        "technologies": [
            "NestJS",
            "Kafka",
            "Elasticsearch",
            "TypeScript",
            "Microservices",
            "Event-Driven Architecture"
        ]
    },
    {
        "title": "4Medica (Sorice Solutions) - Healthcare Platform",
        "description": "Architected and deployed scalable, HIPAA-compliant healthcare solutions streamlining communication between medical professionals, labs, and patients. Built robust 'Order Editing Module' reducing modification turnaround by 70% (10m to 3m) with strict FHIR standard implementation. Led strategic migration of FHIR store from Google Healthcare API to Aidbox, reducing infrastructure costs by ~30%. Designed high-throughput catalog service using Elasticsearch for thousands of lab tests. Engineered multi-tenant user management system for complex organizational hierarchies.",
        "link": "",
        "img": "/projects/4medica.webp",
        "technologies": [
            "NestJS",
            "Node.js",
            "Angular",
            "MongoDB",
            "Elasticsearch",
            "Kafka",
            "gRPC",
            "FHIR",
            "Redis",
            "TypeScript"
        ]
    },
    {
        "title": "PillarPlus & Towercop - MEP Engineering Automation",
        "description": "Spearheaded architecture and development of core algorithmic engines and complex frontend interfaces automating MEP (Mechanical, Electrical, Plumbing) engineering workflows. Developed 'External Drainage Module' compressing design lifecycle from 2 weeks to 3 hours. Engineered real-time visualization modules using advanced geometry, graph, and canvas libraries, reducing user design time by 98% (3 days to 1.5 hours). Built calculation engine automating 6-hour manual process to under 10 minutes. Led end-to-end development of dynamic Form Builder and analytics engine at Towercop subsidiary.",
        "link": "",
        "img": "/projects/pillarplus.webp",
        "technologies": [
            "TypeScript",
            "React",
            "NextJS",
            "Node.js",
            "NestJS",
            "PostgreSQL",
            "MongoDB",
            "Redis"
        ]
    },
    {
        "title": "JiviAI - AI-Powered Sales Training SaaS",
        "description": "Architected multi-tenant SaaS platform enabling companies to onboard and train sales teams at scale. Engineered real-time AI Voice Assistant acting as 'prospect customer' conducting role-play scenarios to train representatives dynamically. Built complete backend infrastructure (NestJS/PostgreSQL) handling multi-organization data isolation and user management. Delivered scalable architecture that accelerated business funding rounds.",
        "link": "",
        "img": "/projects/jivi.webp",
        "technologies": [
            "NestJS",
            "PostgreSQL",
            "TypeScript",
            "Node.js",
            "AI/ML",
            "Microservices"
        ]
    },
    {
        "title": "Vivienth - Telemedicine & Diagnosis Platform",
        "description": "Developed HIPAA-compliant backend facilitating full patient care lifecycle from initial digital assessment to diagnosis and treatment planning. Built Doctor's Portal dashboard allowing providers to review automated diagnostic reports, approve treatment plans, and digitally prescribe medications. Streamlined communication loop between patients and providers ensuring secure and efficient data transmission. Implemented rapid go-to-market solution enabling faster customer acquisition.",
        "link": "",
        "img": "/projects/vivienth.webp",
        "technologies": [
            "NestJS",
            "PostgreSQL",
            "React",
            "Node.js",
            "TypeScript"
        ]
    },
    {
        "title": "Incoguzz - An Anonymous Social Media Platform",
        "description": "Social media app enabling users to chat with random users and post images, videos, audio, and text. Connect with people randomly or with specific users via username. Built with modern tech stack for real-time communication and media sharing.",
        "link": "https://github.com/geetesh911/incoguzz",
        "img": "/projects/incoguzz.webp",
        "technologies": [
            "React Native",
            "Node.js",
            "NestJS",
            "PostgreSQL",
            "TypeScript"
        ]
    }
]